app/controllers/admin/product_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @products = Product.find(params[:id])