app/controllers/carts_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."owner_id" = $1  [["owner_id", 2]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
      @ref = {}
      @total = @shopping_cart.total
      @cart = CartItem.all.where(owner_id: session[:shopping_cart_id])
      puts @cart
      @products = Product.all
      @product_categories = ProductCategory.all
      @products.each do |enr|
        @ref[enr.id] = {:name => @products.where(id: enr.id)[0].name, :category_name => @product_categories.where(id: enr.product_category_id)[0].name}

INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2022-12-05 21:25:26.892697"], ["updated_at", "2022-12-05 21:25:26.892697"]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def extract_shopping_cart
      shopping_cart_id = session[:shopping_cart_id]
      @shopping_cart = session[:shopping_cart_id] ? Cart.find(shopping_cart_id) : Cart.create