app/controllers/home_controller.rb

  def index
    @highlighted_products = Product.where(is_highlighted: true)
---
SELECT "products".* FROM "products" WHERE "products"."is_highlighted" = $1  [["is_highlighted", true]]

  def add
    @product = Product.find(params[:product_id])
    shopping_cart_id = session[:shopping_cart_id]
    @shopping_cart = session[:shopping_cart_id] ? Cart.find(shopping_cart_id) : Cart.create
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2022-12-05 13:51:36.288982"], ["updated_at", "2022-12-05 13:51:36.288982"]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]