app/controllers/home_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2022-12-05 13:51:36.288982"], ["updated_at", "2022-12-05 13:51:36.288982"]]
---
  def index
    @highlighted_products = Product.where(is_highlighted: true)
    if current_user && session[:cart_id]
      puts session[:cart]
    else
      session[:cart_id] = Cart.create.id